<template>
  <q-page class="services">
    <div class="container column">
      <h2 class="text-h3 text-weight-medium text-center">Услуги</h2>
      <div class="content">
        <div class="row list">
          <div 
            class="col-12 col-md-6 item"
            v-for="item in list"
            :key="item.id"
          >
            <q-card class="my-card">
              <q-img :src="item.img">
                <div class="text-subtitle2 absolute-top text-center">
                  <div class="text-h5">{{item.title}}</div>
                  <div class="text-subtitle2">
                    {{item.subtitle}}
                  </div>
                </div>
              </q-img>

              <q-card-section>
                <div class="services__info">
                  <span v-html="item.content"></span>
                </div>
                <q-btn 
                  :label="item.buttonText" 
                  unelevated 
                  rounded 
                  color="primary" 
                  size="md"
                  padding="10px 24px"
                />
              </q-card-section>
            </q-card>

          </div>
        </div>
        <div class="form-sec q-pt-xl">
          <FormPerson />
        </div>
        
        
      </div>
    </div>
  </q-page>
</template>

<script>
import { ref, defineComponent } from 'vue'
import FormPerson from 'src/components/FormPerson'

export default defineComponent({
  components: {
    FormPerson
  },
  setup() {
    const list = ref([
      {
        id: 1,
        title: 'Ознакомительный тур',
        img: 'https://cdn.quasar.dev/img/parallax2.jpg',
        subtitle: 'Довольно непростая задача для покупателя – выбрать квартиру среди разнообразия объектов, представленных на рынке.',
        content: '<p>Если Вы хотите купить жилье своей мечты и выгодно инвестировать сбережения, понадобится учесть все без исключения характеристики: расположение, удаленность от моря, площадь и планировку, виды из окон, набор инфраструктуры, качество строительства и многое другое. <p>Информационный тур в Турцию для выбора недвижимости – один из самых эффективных способов принять верное решение и купить ликвидную собственность. <p><strong>В ознакомительный тур входит:</strong> <ul><li>Встреча в аэропорту и трансфер в Аланию</<li><li>Поселение в комфортабельных апартаментах или апарт-отеле</<li><li>Просмотр выбранных объектов</<li><li>Профессиональное консультирование</<li><li>Обзорная экскурсия по Алании и её районам</<li><li>Обратный трансфер в аэропорт</<li><li>В зависимости от стоимости покупки, возможен возврат стоимости билетов</li></ul> </<p><em>Длительность информационного тура – 5-7 дней</em></p>',
        buttonText: 'Заказать ознакомительный тур'
      },
      {
        id: 2,
        title: 'Онлайн просмотр',
        img: 'https://cdn.quasar.dev/img/parallax2.jpg',
        subtitle: 'Альтернативный и удобный способ посмотреть понравившиеся объекты недвижимости не покидая квартиры.',
        content: '<p>Онлайн просмотр недвижимости с помощью платформ Skype, WhatsApp, Viber, Zoom или других популярных мессенджеров позволит Вам в реальном времени увидеть выбранные квартиры. Вы подаете заявку и после подбора объектов мы договариваемся о виртуальной встрече.</p><p>Вместе с нашим специалистом Вы сможете не только детально рассмотреть внутреннюю планировку, отделку, интерьер помещений, но и пройтись по улице, чтобы Вы прочувствовали средиземноморскую атмосферу курорта. Мы покажем Вам инфраструктуру комплекса, прогуляемся по району и даже спустимся к пляжу.</p><p>В ходе виртуального просмотра апартаментов мы подробно ответим на все интересующие Вас вопросы по объекту и условиям его покупки. Это прекрасная возможность без траты времени и дополнительных финансов объективно оценить возможные инвестиции!</p><p>Помимо онлайн-тура всем нашим покупателям доступна дистанционная покупка недвижимости.</p><p>Заполните заявку и мы свяжемсяс Вами в ближайшее время!</p>',
        buttonText: 'Запросить онлайн просмотр'
      },
      {
        id: 1,
        title: 'Ознакомительный тур',
        img: 'https://cdn.quasar.dev/img/parallax2.jpg',
        subtitle: 'Довольно непростая задача для покупателя – выбрать квартиру среди разнообразия объектов, представленных на рынке.',
        content: '<p>Если Вы хотите купить жилье своей мечты и выгодно инвестировать сбережения, понадобится учесть все без исключения характеристики: расположение, удаленность от моря, площадь и планировку, виды из окон, набор инфраструктуры, качество строительства и многое другое. <p>Информационный тур в Турцию для выбора недвижимости – один из самых эффективных способов принять верное решение и купить ликвидную собственность. <p><strong>В ознакомительный тур входит:</strong> <ul><li>Встреча в аэропорту и трансфер в Аланию</<li><li>Поселение в комфортабельных апартаментах или апарт-отеле</<li><li>Просмотр выбранных объектов</<li><li>Профессиональное консультирование</<li><li>Обзорная экскурсия по Алании и её районам</<li><li>Обратный трансфер в аэропорт</<li><li>В зависимости от стоимости покупки, возможен возврат стоимости билетов</li></ul> </<p><em>Длительность информационного тура – 5-7 дней</em></p>',
        buttonText: 'Заказать ознакомительный тур'
      },
      {
        id: 2,
        title: 'Онлайн просмотр',
        img: 'https://cdn.quasar.dev/img/parallax2.jpg',
        subtitle: 'Альтернативный и удобный способ посмотреть понравившиеся объекты недвижимости не покидая квартиры.',
        content: '<p>Онлайн просмотр недвижимости с помощью платформ Skype, WhatsApp, Viber, Zoom или других популярных мессенджеров позволит Вам в реальном времени увидеть выбранные квартиры. Вы подаете заявку и после подбора объектов мы договариваемся о виртуальной встрече.</p><p>Вместе с нашим специалистом Вы сможете не только детально рассмотреть внутреннюю планировку, отделку, интерьер помещений, но и пройтись по улице, чтобы Вы прочувствовали средиземноморскую атмосферу курорта. Мы покажем Вам инфраструктуру комплекса, прогуляемся по району и даже спустимся к пляжу.</p><p>В ходе виртуального просмотра апартаментов мы подробно ответим на все интересующие Вас вопросы по объекту и условиям его покупки. Это прекрасная возможность без траты времени и дополнительных финансов объективно оценить возможные инвестиции!</p><p>Помимо онлайн-тура всем нашим покупателям доступна дистанционная покупка недвижимости.</p><p>Заполните заявку и мы свяжемсяс Вами в ближайшее время!</p>',
        buttonText: 'Запросить онлайн просмотр'
      },
    ])

    return {
      list
    }
  },
})
</script>
